In [1]:
import pandas as pd
import numpy as np

In [2]:
pip install pymysql

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pymysql in c:\users\rahul\appdata\roaming\python\python311\site-packages (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pymysql as sql

In [4]:
db=sql.connect(host='localhost',user='root',password='Arun@7838@83',db='rkraj')
df2=pd.read_sql_query("select * from empoly ;",db)

df2

C:\Users\rahul\AppData\Local\Temp\ipykernel_34228\2120625837.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2=pd.read_sql_query("select * from empoly ;",db)

      id     name lastname  age  salary    contact
0   1010    rahul    singh   22   25000        NaN
1   1012    tarun   sharma   35   35000        NaN
2   1014     esha   chadda   30   40000        NaN
3   1016     aman   sharma   50   25000        NaN
4   1020     amar   khuran   30   60000        NaN
5   1018     monu   gautam   40   40000        NaN
6   1022    harsh   sharma   28   65000        NaN
7   1022    bunty    singh   20   20000        NaN
8   2020   deepak   sharma   20   25000   121145.0
9   2022  sandeep  chauhan   35   30000  1212546.0
10  2028     sonu   chadda   45   45000  1211435.0
11  2026    harsh  chauhan   45   65000  1213645.0

In [5]:
import pandas as pd

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

print (df)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

missing  value  handling in dataset:--

In [6]:
s=np.array([4,5,6,7,np.nan,99,np.nan])
s

array([ 4.,  5.,  6.,  7., nan, 99., nan])

In [7]:
 # Q kya kya sum nai kar sakte ?

In [8]:
sum(s)

nan

SUB HEADING 
# fillna
# dropna
# how
# any
# all
# bfill
# ffill
# replace
# interpulation
# isnull

In [9]:
df8=pd.read_excel("C:\\Users\\rahul\\Downloads\\DATA12.xlsx")
df8

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth,Salary
0,1.0,Lamtone,IT Services,2009.0,"$11,757,018","6,482,465 Dollars",5274553.0,0.30,NaN
1,2.0,Stripfind,Financial Services,2010.0,"$12,329,371","916,455 Dollars",11412916.0,NaN,NaN
2,3.0,Canecorporation,Health,2012.0,"$10,597,009",NaN,3005820.0,NaN,NaN
3,4.0,NaN,IT Services,2013.0,NaN,"7,429,377 Dollars",6597557.0,NaN,NaN
4,5.0,NaN,NaN,NaN,NaN,"7,435,363 Dollars",3138627.0,NaN,NaN
5,6.0,Techline,Health,2006.0,NaN,"5,470,303 Dollars",8427816.0,0.23,NaN
6,7.0,Cityace,NaN,2010.0,"$9,254,614",NaN,3005116.0,0.06,NaN
7,8.0,Kayelectronics,NaN,2009.0,"$9,451,943","3,878,113 Dollars",5573830.0,0.04,NaN
8,9.0,Ganzlax,IT Services,2011.0,"$14,001,180",NaN,11901180.0,0.18,NaN
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
df8.shape

(10, 9)

In [11]:
df8.count("columns") 

# Columns me kitna data fill hai ke nahi hai

0    8
1    7
2    6
3    5
4    3
5    7
6    6
7    7
8    7
9    0
dtype: int64

In [12]:
df8.count("rows")

# Rows me kitna data fill hai ke nahi hai

ID           9
Name         7
Industry     6
Inception    8
Revenue      6
Expenses     6
Profit       9
Growth       5
Salary       0
dtype: int64

In [13]:
df8.isnull().sum()




# Ex...Id , Name , Industry   esme count karega ki kitne Null vaule hai

ID            1
Name          3
Industry      4
Inception     2
Revenue       4
Expenses      4
Profit        1
Growth        5
Salary       10
dtype: int64

In [14]:
df8.drop(['Salary'],axis=1,inplace=True)

#  inplace parmanent Data/Row   karta hai

In [15]:
df8

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,"$11,757,018","6,482,465 Dollars",5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,"$12,329,371","916,455 Dollars",11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,"$10,597,009",NaN,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,NaN,"7,429,377 Dollars",6597557.0,NaN
4,5.0,NaN,NaN,NaN,NaN,"7,435,363 Dollars",3138627.0,NaN
5,6.0,Techline,Health,2006.0,NaN,"5,470,303 Dollars",8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,"$9,254,614",NaN,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,"$9,451,943","3,878,113 Dollars",5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,"$14,001,180",NaN,11901180.0,0.18
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [16]:
df8.shape

(10, 8)

In [17]:
df8.dropna(how='all')

# Row me sabse jada null value hogi use delete karta hai   dropna   with all

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009.0,"$11,757,018","6,482,465 Dollars",5274553.0,0.30
1,2.0,Stripfind,Financial Services,2010.0,"$12,329,371","916,455 Dollars",11412916.0,NaN
2,3.0,Canecorporation,Health,2012.0,"$10,597,009",NaN,3005820.0,NaN
3,4.0,NaN,IT Services,2013.0,NaN,"7,429,377 Dollars",6597557.0,NaN
4,5.0,NaN,NaN,NaN,NaN,"7,435,363 Dollars",3138627.0,NaN
5,6.0,Techline,Health,2006.0,NaN,"5,470,303 Dollars",8427816.0,0.23
6,7.0,Cityace,NaN,2010.0,"$9,254,614",NaN,3005116.0,0.06
7,8.0,Kayelectronics,NaN,2009.0,"$9,451,943","3,878,113 Dollars",5573830.0,0.04
8,9.0,Ganzlax,IT Services,2011.0,"$14,001,180",NaN,11901180.0,0.18

In [ ]:
# df8.dropna(how='any')

#  row / Columns   me  1 single null value mila   to use pu

In [18]:
# agar hame dekhna hai  80% / 90%   se upper null value  ka % percentage 


df8.isnull().sum()/len(df8)*100

ID           10.0
Name         30.0
Industry     40.0
Inception    20.0
Revenue      40.0
Expenses     40.0
Profit       10.0
Growth       50.0
dtype: float64

In [19]:
#  continue pandas [9]